read_verilog cpu.v
synth -top mod_cpu
show -format png mod_cpu
